galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F777/cpu_reg/stm32F777_rcc.h
/*
; stm32F777_rcc.
; ==============

;------------------------------------------------------------------------
; Author:	Franzi Edo.	The 2006-06-28
; Modifs:
;
; SVN:
; $Author:: efr               $:  Author of last commit
; $Rev:: 113                  $:  Revision of last commit
; $Date:: 2017-04-16 16:55:48#$:  Date of last commit
;
; Project:	uKOS
; Goal:		stm32F777_rcc equates.
;
;   (c) 1992-2017, Franzi Edo.
;   --------------------------
;                                              __ ______  _____
;   Franzi Edo.                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   This program is free software: you can redistribute it and/or modify
;   it under the terms of the GNU Affero General Public License as published by
;   the Free Software Foundation, either version 3 of the License, or
;   (at your option) any later version.
;
;   This program is distributed in the hope that it will be useful,
;   but WITHOUT ANY WARRANTY; without even the implied warranty of
;   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
;   GNU Affero General Public License for more details.
;
;   You should have received a copy of the GNU Affero General Public License
;   along with this program. If not, see <http://www.gnu.org/licenses/>.
;
;------------------------------------------------------------------------
*/

#ifndef __STM32F777_RCC__
#define __STM32F777_RCC__

// RCC address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	CR;
	volatile	uint32_t	PLLCFGR;
	volatile	uint32_t	CFGR;
	volatile	uint32_t	CIR;
	volatile	uint32_t	AHB1RSTR;
	volatile	uint32_t	AHB2RSTR;
	volatile	uint32_t	AHB3RSTR;
	volatile	uint32_t	RESERVED0;
	volatile	uint32_t	APB1RSTR;
	volatile	uint32_t	APB2RSTR;
	volatile	uint32_t	RESERVED1[2];
	volatile	uint32_t	AHB1ENR;
	volatile	uint32_t	AHB2ENR;
	volatile	uint32_t	AHB3ENR;
	volatile	uint32_t	RESERVED2;
	volatile	uint32_t	APB1ENR;
	volatile	uint32_t	APB2ENR;
	volatile	uint32_t	RESERVED3[2];
	volatile	uint32_t	AHB1LPENR;
	volatile	uint32_t	AHB2LPENR;
	volatile	uint32_t	AHB3LPENR;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	APB1LPENR;
	volatile	uint32_t	APB2LPENR;
	volatile	uint32_t	RESERVED5[2];
	volatile	uint32_t	BDCR;
	volatile	uint32_t	CSR;
	volatile	uint32_t	RESERVED6[2];
	volatile	uint32_t	SSCGR;
	volatile	uint32_t	PLLI2SCFGR;
	volatile	uint32_t	PLLSAICFGR;
	volatile	uint32_t	DCKCFGR1;
	volatile	uint32_t	DCKCFGR2;
} RCC_TypeDef;

#define RCC		((RCC_TypeDef *)RCC_BASE)

// RCC_CR register

#define	RCC_CR_HSION				0x00000001	//
#define	RCC_CR_HSIRDY				0x00000002	//
#define	RCC_CR_HSITRIM				0x000000F8	//
#define	RCC_CR_HSITRIM_0			0x00000008	//
#define	RCC_CR_HSITRIM_1			0x00000010	//
#define	RCC_CR_HSITRIM_2			0x00000020	//
#define	RCC_CR_HSITRIM_3			0x00000040	//
#define	RCC_CR_HSITRIM_4			0x00000080	//
#define	RCC_CR_HSICAL				0x0000FF00	//
#define	RCC_CR_HSICAL_0 			0x00000100	//
#define	RCC_CR_HSICAL_1 			0x00000200	//
#define	RCC_CR_HSICAL_2 			0x00000400	//
#define	RCC_CR_HSICAL_3 			0x00000800	//
#define	RCC_CR_HSICAL_4 			0x00001000	//
#define	RCC_CR_HSICAL_5 			0x00002000	//
#define	RCC_CR_HSICAL_6 			0x00004000	//
#define	RCC_CR_HSICAL_7 			0x00008000	//
#define	RCC_CR_HSEON				0x00010000	//
#define	RCC_CR_HSERDY				0x00020000	//
#define	RCC_CR_HSEBYP				0x00040000	//
#define	RCC_CR_CSSON				0x00080000	//
#define	RCC_CR_PLLON				0x01000000	//
#define	RCC_CR_PLLRDY				0x02000000	//
#define	RCC_CR_PLLI2SON 			0x04000000	//
#define	RCC_CR_PLLI2SRDY			0x08000000	//
#define	RCC_CR_PLLSAION				0x10000000	//
#define	RCC_CR_PLLSAIRDY			0x20000000	//

// RCC_PLLCFGR register

#define	RCC_PLLCFGR_PLLM			0x0000003F	//
#define	RCC_PLLCFGR_PLLM_0			0x00000001	//
#define	RCC_PLLCFGR_PLLM_1			0x00000002	//
#define	RCC_PLLCFGR_PLLM_2			0x00000004	//
#define	RCC_PLLCFGR_PLLM_3			0x00000008	//
#define	RCC_PLLCFGR_PLLM_4			0x00000010	//
#define	RCC_PLLCFGR_PLLM_5			0x00000020	//
#define	RCC_PLLCFGR_PLLN 			0x00007FC0	//
#define	RCC_PLLCFGR_PLLN_0 			0x00000040	//
#define	RCC_PLLCFGR_PLLN_1 			0x00000080	//
#define	RCC_PLLCFGR_PLLN_2 			0x00000100	//
#define	RCC_PLLCFGR_PLLN_3 			0x00000200	//
#define	RCC_PLLCFGR_PLLN_4 			0x00000400	//
#define	RCC_PLLCFGR_PLLN_5 			0x00000800	//
#define	RCC_PLLCFGR_PLLN_6 			0x00001000	//
#define	RCC_PLLCFGR_PLLN_7 			0x00002000	//
#define	RCC_PLLCFGR_PLLN_8 			0x00004000	//
#define	RCC_PLLCFGR_PLLP			0x00030000	//
#define	RCC_PLLCFGR_PLLP_0			0x00010000	//
#define	RCC_PLLCFGR_PLLP_1			0x00020000	//
#define	RCC_PLLCFGR_PLLSRC			0x00400000	//
#define	RCC_PLLCFGR_PLLSRC_HSE		0x00400000	//
#define	RCC_PLLCFGR_PLLSRC_HSI		0x00000000	//
#define	RCC_PLLCFGR_PLLQ			0x0F000000	//
#define	RCC_PLLCFGR_PLLQ_0			0x01000000	//
#define	RCC_PLLCFGR_PLLQ_1			0x02000000	//
#define	RCC_PLLCFGR_PLLQ_2			0x04000000	//
#define	RCC_PLLCFGR_PLLQ_3			0x08000000	//

#define RCC_PLLCFGR_PLLM_bit		0			//
#define RCC_PLLCFGR_PLLN_bit		6			//
#define RCC_PLLCFGR_PLLP_bit		16			//
#define RCC_PLLCFGR_PLLQ_DIV9		(9<<24)		//

// RCC_CFGR register

#define	RCC_CFGR_SW 				0x00000003	//
#define	RCC_CFGR_SW_0				0x00000001	//
#define	RCC_CFGR_SW_1				0x00000002	//
#define	RCC_CFGR_SW_HSI 			0x00000000	//
#define	RCC_CFGR_SW_HSE 			0x00000001	//
#define	RCC_CFGR_SW_PLL 			0x00000002	//
#define	RCC_CFGR_SWS				0x0000000C	//
#define	RCC_CFGR_SWS_0				0x00000004	//
#define	RCC_CFGR_SWS_1				0x00000008	//
#define	RCC_CFGR_SWS_HSI			0x00000000	//
#define	RCC_CFGR_SWS_HSE			0x00000004	//
#define	RCC_CFGR_SWS_PLL			0x00000008	//
#define	RCC_CFGR_HPRE				0x000000F0	//
#define	RCC_CFGR_HPRE_0 			0x00000010	//
#define	RCC_CFGR_HPRE_1 			0x00000020	//
#define	RCC_CFGR_HPRE_2 			0x00000040	//
#define	RCC_CFGR_HPRE_3 			0x00000080	//
#define	RCC_CFGR_HPRE_DIV1			0x00000000	//
#define	RCC_CFGR_HPRE_DIV2			0x00000080	//
#define	RCC_CFGR_HPRE_DIV4			0x00000090	//
#define	RCC_CFGR_HPRE_DIV8			0x000000A0	//
#define	RCC_CFGR_HPRE_DIV16   		0x000000B0	//
#define	RCC_CFGR_HPRE_DIV64   		0x000000C0	//
#define	RCC_CFGR_HPRE_DIV128  		0x000000D0	//
#define	RCC_CFGR_HPRE_DIV256  		0x000000E0	//
#define	RCC_CFGR_HPRE_DIV512  		0x000000F0	//
#define	RCC_CFGR_PPRE1				0x00001C00	//
#define	RCC_CFGR_PPRE1_0			0x00000400	//
#define	RCC_CFGR_PPRE1_1			0x00000800	//
#define	RCC_CFGR_PPRE1_2			0x00001000	//
#define	RCC_CFGR_PPRE1_DIV1   		0x00000000	//
#define	RCC_CFGR_PPRE1_DIV2   		0x00001000	//
#define	RCC_CFGR_PPRE1_DIV4   		0x00001400	//
#define	RCC_CFGR_PPRE1_DIV8   		0x00001800	//
#define	RCC_CFGR_PPRE1_DIV16  		0x00001C00	//
#define	RCC_CFGR_PPRE2				0x0000E000	//
#define	RCC_CFGR_PPRE2_0			0x00002000	//
#define	RCC_CFGR_PPRE2_1			0x00004000	//
#define	RCC_CFGR_PPRE2_2			0x00008000	//
#define	RCC_CFGR_PPRE2_DIV1   		0x00000000	//
#define	RCC_CFGR_PPRE2_DIV2   		0x00008000	//
#define	RCC_CFGR_PPRE2_DIV4   		0x0000A000	//
#define	RCC_CFGR_PPRE2_DIV8   		0x0000C000	//
#define	RCC_CFGR_PPRE2_DIV16  		0x0000E000	//
#define	RCC_CFGR_RTCPRE 			0x001F0000	//
#define	RCC_CFGR_RTCPRE_0 			0x00010000	//
#define	RCC_CFGR_RTCPRE_1 			0x00020000	//
#define	RCC_CFGR_RTCPRE_2 			0x00040000	//
#define	RCC_CFGR_RTCPRE_3 			0x00080000	//
#define	RCC_CFGR_RTCPRE_4 			0x00100000	//
#define	RCC_CFGR_MCO1				0x00600000	//
#define	RCC_CFGR_MCO1_0 			0x00200000	//
#define	RCC_CFGR_MCO1_1 			0x00400000	//
#define	RCC_CFGR_I2SSRC 			0x00800000	//
#define	RCC_CFGR_MCO1PRE			0x07000000	//
#define	RCC_CFGR_MCO1PRE_0			0x01000000	//
#define	RCC_CFGR_MCO1PRE_1			0x02000000	//
#define	RCC_CFGR_MCO1PRE_2			0x04000000	//
#define	RCC_CFGR_MCO2PRE			0x38000000	//
#define	RCC_CFGR_MCO2PRE_0			0x08000000	//
#define	RCC_CFGR_MCO2PRE_1			0x10000000	//
#define	RCC_CFGR_MCO2PRE_2			0x20000000	//
#define	RCC_CFGR_MCO2				0xC0000000	//
#define	RCC_CFGR_MCO2_0 			0x40000000	//
#define	RCC_CFGR_MCO2_1 			0x80000000	//

// RCC_CIR register

