galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F777/cpu_reg/stm32F777_rcc.h
// RCC_APB2ENR register

#define	RCC_APB2ENR_TIM1EN  		0x00000001	//
#define	RCC_APB2ENR_TIM8EN  		0x00000002	//
#define	RCC_APB2ENR_USART1EN		0x00000010	//
#define	RCC_APB2ENR_USART6EN		0x00000020	//
#define	RCC_APB2ENR_ADC1EN  		0x00000100	//
#define	RCC_APB2ENR_ADC2EN  		0x00000200	//
#define	RCC_APB2ENR_ADC3EN  		0x00000400	//
#define	RCC_APB2ENR_SDMMC1EN		0x00000800	//
#define	RCC_APB2ENR_SPI1EN  		0x00001000	//
#define	RCC_APB2ENR_SPI4EN  		0x00002000	//
#define	RCC_APB2ENR_SYSCFGEN		0x00004000	//
#define	RCC_APB2ENR_TIM9EN  		0x00010000	//
#define	RCC_APB2ENR_TIM10EN 		0x00020000	//
#define	RCC_APB2ENR_TIM11EN 		0x00040000	//
#define	RCC_APB2ENR_SPI5EN  		0x00100000	//
#define	RCC_APB2ENR_SPI6EN  		0x00200000	//
#define	RCC_APB2ENR_SAI1EN  		0x00400000	//
#define	RCC_APB2ENR_SAI2EN  		0x00800000	//
#define	RCC_APB2ENR_LTDCEN  		0x04000000	//

// RCC_AHB1LPENR register

#define	RCC_AHB1LPENR_GPIOALPEN    	0x00000001	//
#define	RCC_AHB1LPENR_GPIOBLPEN    	0x00000002	//
#define	RCC_AHB1LPENR_GPIOCLPEN    	0x00000004	//
#define	RCC_AHB1LPENR_GPIODLPEN    	0x00000008	//
#define	RCC_AHB1LPENR_GPIOELPEN    	0x00000010	//
#define	RCC_AHB1LPENR_GPIOFLPEN    	0x00000020	//
#define	RCC_AHB1LPENR_GPIOGLPEN    	0x00000040	//
#define	RCC_AHB1LPENR_GPIOHLPEN    	0x00000080	//
#define	RCC_AHB1LPENR_GPIOILPEN    	0x00000100	//
#define	RCC_AHB1LPENR_GPIOJLPEN    	0x00000200	//
#define	RCC_AHB1LPENR_GPIOKLPEN    	0x00000400	//
#define	RCC_AHB1LPENR_CRCLPEN      	0x00001000	//
#define	RCC_AHB1LPENR_AXILPEN      	0x00002000	//
#define	RCC_AHB1LPENR_FLITFLPEN    	0x00008000	//
#define	RCC_AHB1LPENR_SRAM1LPEN    	0x00010000	//
#define	RCC_AHB1LPENR_SRAM2LPEN    	0x00020000	//
#define	RCC_AHB1LPENR_BKPSRAMLPEN  	0x00040000	//
#define	RCC_AHB1LPENR_DTCMLPEN     	0x00100000	//
#define	RCC_AHB1LPENR_DMA1LPEN     	0x00200000	//
#define	RCC_AHB1LPENR_DMA2LPEN     	0x00400000	//
#define	RCC_AHB1LPENR_DMA2DLPEN    	0x00800000	//
#define	RCC_AHB1LPENR_ETHMACLPEN   	0x02000000	//
#define	RCC_AHB1LPENR_ETHMACTXLPEN 	0x04000000	//
#define	RCC_AHB1LPENR_ETHMACRXLPEN 	0x08000000	//
#define	RCC_AHB1LPENR_ETHMACPTPLPEN	0x10000000	//
#define	RCC_AHB1LPENR_OTGHSLPEN    	0x20000000	//
#define	RCC_AHB1LPENR_OTGHSULPILPEN	0x40000000	//

// RCC_AHB2LPENR register

#define	RCC_AHB2LPENR_DCMILPEN		0x00000001	//
#define	RCC_AHB2LPENR_JPEGLPEN		0x00000002	//
#define	RCC_AHB2LPENR_CRYPLPEN		0x00000010	//
#define	RCC_AHB2LPENR_HASHLPEN		0x00000020	//
#define	RCC_AHB2LPENR_RNGLPEN 		0x00000040	//
#define	RCC_AHB2LPENR_OTGFSLPEN		0x00000080	//

// RCC_AHB3LPENR register

#define	RCC_AHB3LPENR_FSMCLPEN		0x00000001	//
#define	RCC_AHB3LPENR_QSPILPEN		0x00000002	//

// RCC_APB1LPENR register

#define	RCC_APB1LPENR_TIM2LPEN   	0x00000001	//
#define	RCC_APB1LPENR_TIM3LPEN   	0x00000002	//
#define	RCC_APB1LPENR_TIM4LPEN   	0x00000004	//
#define	RCC_APB1LPENR_TIM5LPEN   	0x00000008	//
#define	RCC_APB1LPENR_TIM6LPEN   	0x00000010	//
#define	RCC_APB1LPENR_TIM7LPEN   	0x00000020	//
#define	RCC_APB1LPENR_TIM12LPEN  	0x00000040	//
#define	RCC_APB1LPENR_TIM13LPEN  	0x00000080	//
#define	RCC_APB1LPENR_TIM14LPEN  	0x00000100	//
#define	RCC_APB1LPENR_LPTIM1LPEN 	0x00000200	//
#define	RCC_APB1LPENR_WWDGLPEN   	0x00000800	//
#define	RCC_APB1LPENR_SPI2LPEN   	0x00004000	//
#define	RCC_APB1LPENR_SPI3LPEN   	0x00008000	//
#define	RCC_APB1LPENR_SPDIFRXLPEN	0x00010000	//
#define	RCC_APB1LPENR_USART2LPEN 	0x00020000	//
#define	RCC_APB1LPENR_USART3LPEN 	0x00040000	//
#define	RCC_APB1LPENR_UART4LPEN  	0x00080000	//
#define	RCC_APB1LPENR_UART5LPEN  	0x00100000	//
#define	RCC_APB1LPENR_I2C1LPEN   	0x00200000	//
#define	RCC_APB1LPENR_I2C2LPEN   	0x00400000	//
#define	RCC_APB1LPENR_I2C3LPEN   	0x00800000	//
#define	RCC_APB1LPENR_I2C4LPEN   	0x01000000	//
#define	RCC_APB1LPENR_CAN1LPEN   	0x02000000	//
#define	RCC_APB1LPENR_CAN2LPEN   	0x04000000	//
#define	RCC_APB1LPENR_CECLPEN    	0x08000000	//
#define	RCC_APB1LPENR_PWRLPEN    	0x10000000	//
#define	RCC_APB1LPENR_DACLPEN    	0x20000000	//
#define	RCC_APB1LPENR_UART7LPEN  	0x40000000	//
#define	RCC_APB1LPENR_UART8LPEN  	0x80000000	//

// RCC_APB2LPENR register

#define	RCC_APB2LPENR_TIM1LPEN  	0x00000001	//
#define	RCC_APB2LPENR_TIM8LPEN  	0x00000002	//
#define	RCC_APB2LPENR_USART1LPEN	0x00000010	//
#define	RCC_APB2LPENR_USART6LPEN	0x00000020	//
#define	RCC_APB2LPENR_ADC1LPEN  	0x00000100	//
#define	RCC_APB2LPENR_ADC2LPEN  	0x00000200	//
#define	RCC_APB2LPENR_ADC3LPEN  	0x00000400	//
#define	RCC_APB2LPENR_SDMMC1LPEN	0x00000800	//
#define	RCC_APB2LPENR_SPI1LPEN  	0x00001000	//
#define	RCC_APB2LPENR_SPI4LPEN  	0x00002000	//
#define	RCC_APB2LPENR_SYSCFGLPEN	0x00004000	//
#define	RCC_APB2LPENR_TIM9LPEN  	0x00010000	//
#define	RCC_APB2LPENR_TIM10LPEN 	0x00020000	//
#define	RCC_APB2LPENR_TIM11LPEN 	0x00040000	//
#define	RCC_APB2LPENR_SPI5LPEN  	0x00100000	//
#define	RCC_APB2LPENR_SPI6LPEN  	0x00200000	//
#define	RCC_APB2LPENR_SAI1LPEN  	0x00400000	//
#define	RCC_APB2LPENR_SAI2LPEN  	0x00800000	//
#define	RCC_APB2LPENR_LTDCLPEN  	0x04000000	//

// RCC_BDCR register

#define	RCC_BDCR_LSEON    			0x00000001	//
#define	RCC_BDCR_LSERDY   			0x00000002	//
#define	RCC_BDCR_LSEBYP   			0x00000004	//
#define	RCC_BDCR_LSEDRV   			0x00000018	//
#define	RCC_BDCR_LSEDRV_0 			0x00000008	//
#define	RCC_BDCR_LSEDRV_1 			0x00000010	//
#define	RCC_BDCR_RTCSEL   			0x00000300	//
#define	RCC_BDCR_RTCSEL_0 			0x00000100	//
#define	RCC_BDCR_RTCSEL_1 			0x00000200	//
#define	RCC_BDCR_RTCEN    			0x00008000	//
#define	RCC_BDCR_BDRST    			0x00010000	//

// RCC_CSR register

#define	RCC_CSR_LSION   			0x00000001	//
#define	RCC_CSR_LSIRDY  			0x00000002	//
#define	RCC_CSR_RMVF    			0x01000000	//
#define	RCC_CSR_BORRSTF 			0x02000000	//
#define	RCC_CSR_PINRSTF 			0x04000000	//
#define	RCC_CSR_PORRSTF 			0x08000000	//
#define	RCC_CSR_SFTRSTF 			0x10000000	//
#define	RCC_CSR_IWDGRSTF			0x20000000	//
#define	RCC_CSR_WWDGRSTF			0x40000000	//
#define	RCC_CSR_LPWRRSTF			0x80000000	//

// RCC_SSCGR register

#define	RCC_SSCGR_MODPER			0x00001FFF	//
#define	RCC_SSCGR_INCSTEP 			0x0FFFE000	//
#define	RCC_SSCGR_SPREADSEL   		0x40000000	//
#define	RCC_SSCGR_SSCGEN			0x80000000	//

// RCC_PLLI2SCFGR register

#define	RCC_PLLI2SCFGR_PLLI2SN  	0x00007FC0	//
#define	RCC_PLLI2SCFGR_PLLI2SN_0	0x00000040	//
#define	RCC_PLLI2SCFGR_PLLI2SN_1	0x00000080	//
#define	RCC_PLLI2SCFGR_PLLI2SN_2	0x00000100	//
#define	RCC_PLLI2SCFGR_PLLI2SN_3	0x00000200	//
#define	RCC_PLLI2SCFGR_PLLI2SN_4	0x00000400	//
#define	RCC_PLLI2SCFGR_PLLI2SN_5	0x00000800	//
#define	RCC_PLLI2SCFGR_PLLI2SN_6	0x00001000	//
#define	RCC_PLLI2SCFGR_PLLI2SN_7	0x00002000	//
#define	RCC_PLLI2SCFGR_PLLI2SN_8	0x00004000	//
#define	RCC_PLLI2SCFGR_PLLI2SP  	0x00030000	//
#define	RCC_PLLI2SCFGR_PLLI2SP_0	0x00010000	//
#define	RCC_PLLI2SCFGR_PLLI2SP_1	0x00020000	//
#define	RCC_PLLI2SCFGR_PLLI2SQ  	0x0F000000	//
#define	RCC_PLLI2SCFGR_PLLI2SQ_0	0x01000000	//
#define	RCC_PLLI2SCFGR_PLLI2SQ_1	0x02000000	//
#define	RCC_PLLI2SCFGR_PLLI2SQ_2	0x04000000	//
#define	RCC_PLLI2SCFGR_PLLI2SQ_3	0x08000000	//
#define	RCC_PLLI2SCFGR_PLLI2SR  	0x70000000	//
#define	RCC_PLLI2SCFGR_PLLI2SR_0	0x10000000	//
#define	RCC_PLLI2SCFGR_PLLI2SR_1	0x20000000	//
#define	RCC_PLLI2SCFGR_PLLI2SR_2	0x40000000	//

// RCC_PLLSAICFGR register

#define	RCC_PLLSAICFGR_PLLSAIN  	0x00007FC0	//
#define	RCC_PLLSAICFGR_PLLSAIN_0	0x00000040	//
#define	RCC_PLLSAICFGR_PLLSAIN_1	0x00000080	//
#define	RCC_PLLSAICFGR_PLLSAIN_2	0x00000100	//
#define	RCC_PLLSAICFGR_PLLSAIN_3	0x00000200	//
#define	RCC_PLLSAICFGR_PLLSAIN_4	0x00000400	//
#define	RCC_PLLSAICFGR_PLLSAIN_5	0x00000800	//
#define	RCC_PLLSAICFGR_PLLSAIN_6	0x00001000	//
#define	RCC_PLLSAICFGR_PLLSAIN_7	0x00002000	//
#define	RCC_PLLSAICFGR_PLLSAIN_8	0x00004000	//
#define	RCC_PLLSAICFGR_PLLSAIP  	0x00030000	//
#define	RCC_PLLSAICFGR_PLLSAIP_0	0x00010000	//
#define	RCC_PLLSAICFGR_PLLSAIP_1	0x00020000	//
#define	RCC_PLLSAICFGR_PLLSAIQ  	0x0F000000	//
#define	RCC_PLLSAICFGR_PLLSAIQ_0	0x01000000	//
#define	RCC_PLLSAICFGR_PLLSAIQ_1	0x02000000	//
#define	RCC_PLLSAICFGR_PLLSAIQ_2	0x04000000	//
#define	RCC_PLLSAICFGR_PLLSAIQ_3	0x08000000	//
#define	RCC_PLLSAICFGR_PLLSAIR  	0x70000000	//
#define	RCC_PLLSAICFGR_PLLSAIR_0	0x10000000	//
#define	RCC_PLLSAICFGR_PLLSAIR_1	0x20000000	//
#define	RCC_PLLSAICFGR_PLLSAIR_2	0x40000000	//

// RCC_DCKCFGR1 register

#define	RCC_DCKCFGR1_PLLI2SDIVQ  	0x0000001F	//
#define	RCC_DCKCFGR1_PLLI2SDIVQ_0	0x00000001	//
#define	RCC_DCKCFGR1_PLLI2SDIVQ_1	0x00000002	//
#define	RCC_DCKCFGR1_PLLI2SDIVQ_2	0x00000004	//
#define	RCC_DCKCFGR1_PLLI2SDIVQ_3	0x00000008	//
#define	RCC_DCKCFGR1_PLLI2SDIVQ_4	0x00000010	//
#define	RCC_DCKCFGR1_PLLSAIDIVQ  	0x00001F00	//
#define	RCC_DCKCFGR1_PLLSAIDIVQ_0	0x00000100	//
#define	RCC_DCKCFGR1_PLLSAIDIVQ_1	0x00000200	//
#define	RCC_DCKCFGR1_PLLSAIDIVQ_2	0x00000400	//
#define	RCC_DCKCFGR1_PLLSAIDIVQ_3	0x00000800	//
#define	RCC_DCKCFGR1_PLLSAIDIVQ_4	0x00001000	//
#define	RCC_DCKCFGR1_PLLSAIDIVR  	0x00030000	//
#define	RCC_DCKCFGR1_PLLSAIDIVR_0	0x00010000	//
#define	RCC_DCKCFGR1_PLLSAIDIVR_1	0x00020000	//
#define	RCC_DCKCFGR1_SAI1SEL     	0x00300000	//
#define	RCC_DCKCFGR1_SAI1SEL_0   	0x00100000	//
#define	RCC_DCKCFGR1_SAI1SEL_1   	0x00200000	//
#define	RCC_DCKCFGR1_SAI2SEL     	0x00C00000	//
#define	RCC_DCKCFGR1_SAI2SEL_0   	0x00400000	//
#define	RCC_DCKCFGR1_SAI2SEL_1   	0x00800000	//
#define	RCC_DCKCFGR1_TIMPRE      	0x01000000	//

