galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F777/cpu_reg/stm32F777_rcc.h
// RCC_DCKCFGR2 register

#define	RCC_DCKCFGR2_USART1SEL   	0x00000003	//
#define	RCC_DCKCFGR2_USART1SEL_0 	0x00000001	//
#define	RCC_DCKCFGR2_USART1SEL_1 	0x00000002	//
#define	RCC_DCKCFGR2_USART2SEL   	0x0000000C	//
#define	RCC_DCKCFGR2_USART2SEL_0 	0x00000004	//
#define	RCC_DCKCFGR2_USART2SEL_1 	0x00000008	//
#define	RCC_DCKCFGR2_USART3SEL   	0x00000030	//
#define	RCC_DCKCFGR2_USART3SEL_0 	0x00000010	//
#define	RCC_DCKCFGR2_USART3SEL_1 	0x00000020	//
#define	RCC_DCKCFGR2_UART4SEL    	0x000000C0	//
#define	RCC_DCKCFGR2_UART4SEL_0  	0x00000040	//
#define	RCC_DCKCFGR2_UART4SEL_1  	0x00000080	//
#define	RCC_DCKCFGR2_UART5SEL    	0x00000300	//
#define	RCC_DCKCFGR2_UART5SEL_0  	0x00000100	//
#define	RCC_DCKCFGR2_UART5SEL_1  	0x00000200	//
#define	RCC_DCKCFGR2_USART6SEL   	0x00000C00	//
#define	RCC_DCKCFGR2_USART6SEL_0 	0x00000400	//
#define	RCC_DCKCFGR2_USART6SEL_1 	0x00000800	//
#define	RCC_DCKCFGR2_UART7SEL    	0x00003000	//
#define	RCC_DCKCFGR2_UART7SEL_0  	0x00001000	//
#define	RCC_DCKCFGR2_UART7SEL_1  	0x00002000	//
#define	RCC_DCKCFGR2_UART8SEL    	0x0000C000	//
#define	RCC_DCKCFGR2_UART8SEL_0  	0x00004000	//
#define	RCC_DCKCFGR2_UART8SEL_1  	0x00008000	//
#define	RCC_DCKCFGR2_I2C1SEL     	0x00030000	//
#define	RCC_DCKCFGR2_I2C1SEL_0   	0x00010000	//
#define	RCC_DCKCFGR2_I2C1SEL_1   	0x00020000	//
#define	RCC_DCKCFGR2_I2C2SEL     	0x000C0000	//
#define	RCC_DCKCFGR2_I2C2SEL_0   	0x00040000	//
#define	RCC_DCKCFGR2_I2C2SEL_1   	0x00080000	//
#define	RCC_DCKCFGR2_I2C3SEL     	0x00300000	//
#define	RCC_DCKCFGR2_I2C3SEL_0   	0x00100000	//
#define	RCC_DCKCFGR2_I2C3SEL_1   	0x00200000	//
#define	RCC_DCKCFGR2_I2C4SEL     	0x00C00000	//
#define	RCC_DCKCFGR2_I2C4SEL_0   	0x00400000	//
#define	RCC_DCKCFGR2_I2C4SEL_1   	0x00800000	//
#define	RCC_DCKCFGR2_LPTIM1SEL   	0x03000000	//
#define	RCC_DCKCFGR2_LPTIM1SEL_0 	0x01000000	//
#define	RCC_DCKCFGR2_LPTIM1SEL_1 	0x02000000	//
#define	RCC_DCKCFGR2_CECSEL      	0x04000000	//
#define	RCC_DCKCFGR2_CK48MSEL    	0x08000000	//
#define	RCC_DCKCFGR2_SDMMC1SEL   	0x10000000	//
#endif
